import * as React from 'react';

function Privacy() {
  return (
    <div id="privacy">
      <div>
        <section>
          <h3>プライバシーポリシー</h3>

          <h4>1. 前書き</h4>
          <p>
            このポリシーでは、せいゆうろうどうくかいの書庫のWebサイト（以下「本サービス」と言います）を使用する際に収集する情報について説明します。
            また、その情報のせいゆうろうどうくかいの書庫プロジェクト（以下「本プロジェクト」といいます。）による保存に関しても説明します。
        </p>

          <h4>2. 情報の収集について</h4>
          <p>本プロジェクトはユーザーのプライバシーを保護することを約束します。</p>

          <p>
            2020年4月13日現在、本サービスはユーザー情報を利用するデータベース項目を保有せず、本サービスが積極的にユーザーの情報をサーバー等に永続化することはありません。
            通信上の各項目（IPアドレスなどの通信に必須なもの、HTTPヘッダのように通信へ通常記されるもの）は、サーバーのログに永続化される可能性があります。
        </p>

          <p>
            Twitterのツイート情報はTwitter社から提供されており、その扱いは同社のプライバシーポリシー
          （<a target="_blank" href="https://twitter.com/ja/privacy">https://twitter.com/ja/privacy</a>）
          に従います。
        </p>

          <h4>3. このポリシーの変更</h4>
          <p>
            これらの規約はいつでも変更できます。GitHubにプライバシーポリシーに対するすべての変更の履歴を保持しています。都度ご確認の上ご利用ください。
        </p>

          <h4>4. 附則</h4>
          <p>
            (実施期日)<br />
          このプライバシーポリシーは、2020年4月13日より実施します。
        </p>
          <p>
            文責 佐藤 正志（@ms2sato）<br />
          せいゆうろうどうくかいの書庫プロジェクト
          </p>
        </section>
      </div>
    </div>
  )
}

export default Privacy