import * as React from 'react';
import Roll from './common/Roll';

function Terms() {
  return (
    <Roll>
      <section>
        <h3>利用規約</h3>

        <h4>1. はじめに</h4>

        <p>
          このウェブサイト（<a href="https://voice-archive.web.app"
          >https://voice-archive.web.app</a
          >、以下「本サイト」といいます。） のご利用にあたっては、
        事前にこの利用規約（以下「本規約」といいます。）をご一読頂き、同意された場合にのみご利用下さい。
        本サイトを開きコンテンツを閲覧した際、本規約に同意しているとみなされます。
      </p>

        <p>
          せいゆうろうどうくかいの書庫プロジェクト（以下「本プロジェクト」といいます。）は、予告なく本規約の内容を変更する場合がありますので、あらかじめご了承下さい。
          本サイトを構築する上で必要なソースコード（外部サービスのキーなどは除く）は全てGitHub上にアップロードされており、「あるがまま」としてご利用いただけます。
          不明点などございましたらコード上の処理を含めてご確認することができるようになっています。
      </p>

        <p>
          また、本プロジェクトはTwitter上の「#せいゆうろうどくかい」および「#せいゆうろうどくかい図書館」のハッシュタグ（以下「元ハッシュタグ」と言います）の活動に感銘を受けた発起人が、同ハッシュタグやその関係者と無関係にかつ自主的に行うものです。
          したがって、本プロジェクトについて元ハッシュタグその他同様のタグの関係者にも全く関係の無い活動であることを明記します。
          本プロジェクトが元ハッシュタグの活動の妨げになることは望みませんし、そういった場合には本サイトを閉鎖するものであります。
      </p>

        <h4>2. 禁止事項</h4>
        <p>本サイトのご利用に際し、次の行為は、禁止させていただきます。</p>
        <ol>
          <li>
            本プロジェクトまたは第三者の財産もしくはプライバシーなどを侵害する行為、または侵害する恐れのある行為
        </li>
          <li>
            本プロジェクトまたは第三者に、不利益もしくは損害を与える行為、またはその恐れのある行為
        </li>
          <li>公序良俗に反する行為、またはその恐れのある行為</li>
          <li>
            犯罪行為もしくは犯罪行為に結びつく行為、またはその恐れのある行為
        </li>
          <li>
            営業活動もしくは営利を目的とする行為、またはその準備を目的とする行為
        </li>
          <li>
            コンピュータウィルス等有害なプログラムを使用または提供する行為
        </li>
          <li>
            その他、法律、法令もしくは条例に違反する行為、またはその恐れのある行為
        </li>
          <li>その他、本プロジェクトが不適切と判断する行為</li>
        </ol>
        <p>
          本プロジェクトは、上記の禁止行為を発見した場合、ユーザーに事前に通知することなく、その全部または一部を削除することがあります。
          ただし、常に本サイトを監視する義務を負うものではありません。
      </p>

        <h4>3. 著作権等について</h4>
        <ol>
          <li>
            本サイトに掲載されているTwitterのツイートおよびそれに含まれるコンテンツについては、Tiwtter社の利用規約に則り利用されます。本サイトが権利を主張するものではありません。
        </li>
          <li>
            本サイトに掲載されている情報に関わる著作権その他の権利は、本プロジェクトまたは本プロジェクトに使用を認めた権利者に帰属しますので、
            私的使用など法律によって認められる範囲を超えて、無断で使用（複製、改ざん、頒布などを含む。）することはできません。
        </li>
          <li>
            本サイトで使用される商標は、本プロジェクトまたは本プロジェクトに使用を認めた権利者に帰属しますので、無断で使用することはできません。
        </li>
        </ol>

        <h4>4. 免責事項について</h4>
        <ol>
          <li>
            本プロジェクトは、本サイトに掲載されている情報についてその正確性および完全性などに関して、いかなる保証もするものではありません。
        </li>
          <li>
            本プロジェクトは、予告なしに、本サイトの運営を停止または中止し、また本サイトに掲載されている情報の全部または一部を変更する場合があります。
        </li>
          <li>
            ユーザーが本サイトをご利用されたこと、またはご利用できなかったことによりユーザーに生じる一切の損害および第三者によるデータの書き込み、
            不正なアクセス、発言等に関して生じる一切の損害について、本プロジェクトは、何ら責任を負うものではありません。
        </li>
        </ol>

        <h4>5. 個人情報の取り扱いについて</h4>
        <p>
          本プロジェクトは、別途定めるプライバシーポリシーに従って、ユーザーの個人情報を適正に取り扱うことをお約束いたします。
      </p>

        <h4>6. 推奨環境</h4>
        <p>
          本サイトをご覧になる際には、下記環境をご利用されることを推奨いたします。推奨環境以外では、当サイトの一部がご利用いただけないことがあります。
      </p>
        <p>Google Chrome 最新バージョン</p>

        <h4>7. リンクサイトについて</h4>
        <p>
          本サイトから、または本サイトへリンクを張っている第三者のウェブサイト（以下「リンクサイト」といいます。）
        の内容およびリンクサイトの利用により生じる一切の損害について、本プロジェクトは、いかなる責任も負うものではありません。<br />
        本サイトへのリンクは原則として自由ですが、リンクされているウェブサイトの内容（公序良俗に反するなど）やリンクの方法によっては、
        事前事後にかかわらず、リンクをお断りする場合があります。
      </p>

        <h4>8. 準拠法・管轄裁判所について</h4>
        <p>
          本サイトおよび本規約の解釈および運用は、日本法に準拠します。<br />
            本サイトおよび本規約に関わる紛争は、東京地方裁判所を第一審の専属管轄裁判所とします。
      </p>

        <h4>9. 責任者および発起人</h4>
        <p>
          佐藤正志（@ms2sato）
      </p>
      </section>
    </Roll>
  )
}

export default Terms